balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66J94.PIC
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG4L" edc:default="0xFF" edc:desc="" edc:impl="0xff" edc:name="CONFIG4L" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xFF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPFP" edc:desc="Write/Erase Protect Page Start/End Boundary" edc:mask="0xff" edc:name="WPFP" edc:nzwidth="8">
              <edc:DCRFieldSemantic edc:cname="WPFP0" edc:desc="Write Protect Program Flash Page 0" edc:when="(field &amp; 0xff) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP1" edc:desc="Write Protect Program Flash Page 1" edc:when="(field &amp; 0xff) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP2" edc:desc="Write Protect Program Flash Page 2" edc:when="(field &amp; 0xff) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP3" edc:desc="Write Protect Program Flash Page 3" edc:when="(field &amp; 0xff) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP4" edc:desc="Write Protect Program Flash Page 4" edc:when="(field &amp; 0xff) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP5" edc:desc="Write Protect Program Flash Page 5" edc:when="(field &amp; 0xff) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP6" edc:desc="Write Protect Program Flash Page 6" edc:when="(field &amp; 0xff) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP7" edc:desc="Write Protect Program Flash Page 7" edc:when="(field &amp; 0xff) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP8" edc:desc="Write Protect Program Flash Page 8" edc:when="(field &amp; 0xff) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP9" edc:desc="Write Protect Program Flash Page 9" edc:when="(field &amp; 0xff) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP10" edc:desc="Write Protect Program Flash Page 10" edc:when="(field &amp; 0xff) == 0xA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP11" edc:desc="Write Protect Program Flash Page 11" edc:when="(field &amp; 0xff) == 0xB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP12" edc:desc="Write Protect Program Flash Page 12" edc:when="(field &amp; 0xff) == 0xC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP13" edc:desc="Write Protect Program Flash Page 13" edc:when="(field &amp; 0xff) == 0xD"/>
              <edc:DCRFieldSemantic edc:cname="WPFP14" edc:desc="Write Protect Program Flash Page 14" edc:when="(field &amp; 0xff) == 0xE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP15" edc:desc="Write Protect Program Flash Page 15" edc:when="(field &amp; 0xff) == 0xF"/>
              <edc:DCRFieldSemantic edc:cname="WPFP16" edc:desc="Write Protect Program Flash Page 16" edc:when="(field &amp; 0xff) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="WPFP17" edc:desc="Write Protect Program Flash Page 17" edc:when="(field &amp; 0xff) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="WPFP18" edc:desc="Write Protect Program Flash Page 18" edc:when="(field &amp; 0xff) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="WPFP19" edc:desc="Write Protect Program Flash Page 19" edc:when="(field &amp; 0xff) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="WPFP20" edc:desc="Write Protect Program Flash Page 20" edc:when="(field &amp; 0xff) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="WPFP21" edc:desc="Write Protect Program Flash Page 21" edc:when="(field &amp; 0xff) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="WPFP22" edc:desc="Write Protect Program Flash Page 22" edc:when="(field &amp; 0xff) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="WPFP23" edc:desc="Write Protect Program Flash Page 23" edc:when="(field &amp; 0xff) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="WPFP24" edc:desc="Write Protect Program Flash Page 24" edc:when="(field &amp; 0xff) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="WPFP25" edc:desc="Write Protect Program Flash Page 25" edc:when="(field &amp; 0xff) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="WPFP26" edc:desc="Write Protect Program Flash Page 26" edc:when="(field &amp; 0xff) == 0x1A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP27" edc:desc="Write Protect Program Flash Page 27" edc:when="(field &amp; 0xff) == 0x1B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP28" edc:desc="Write Protect Program Flash Page 28" edc:when="(field &amp; 0xff) == 0x1C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP29" edc:desc="Write Protect Program Flash Page 29" edc:when="(field &amp; 0xff) == 0x1D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP30" edc:desc="Write Protect Program Flash Page 30" edc:when="(field &amp; 0xff) == 0x1E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP31" edc:desc="Write Protect Program Flash Page 31" edc:when="(field &amp; 0xff) == 0x1F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP32" edc:desc="Write Protect Program Flash Page 32" edc:when="(field &amp; 0xff) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="WPFP33" edc:desc="Write Protect Program Flash Page 33" edc:when="(field &amp; 0xff) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="WPFP34" edc:desc="Write Protect Program Flash Page 34" edc:when="(field &amp; 0xff) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="WPFP35" edc:desc="Write Protect Program Flash Page 35" edc:when="(field &amp; 0xff) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="WPFP36" edc:desc="Write Protect Program Flash Page 36" edc:when="(field &amp; 0xff) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="WPFP37" edc:desc="Write Protect Program Flash Page 37" edc:when="(field &amp; 0xff) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="WPFP38" edc:desc="Write Protect Program Flash Page 38" edc:when="(field &amp; 0xff) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="WPFP39" edc:desc="Write Protect Program Flash Page 39" edc:when="(field &amp; 0xff) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="WPFP40" edc:desc="Write Protect Program Flash Page 40" edc:when="(field &amp; 0xff) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="WPFP41" edc:desc="Write Protect Program Flash Page 41" edc:when="(field &amp; 0xff) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="WPFP42" edc:desc="Write Protect Program Flash Page 42" edc:when="(field &amp; 0xff) == 0x2A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP43" edc:desc="Write Protect Program Flash Page 43" edc:when="(field &amp; 0xff) == 0x2B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP44" edc:desc="Write Protect Program Flash Page 44" edc:when="(field &amp; 0xff) == 0x2C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP45" edc:desc="Write Protect Program Flash Page 45" edc:when="(field &amp; 0xff) == 0x2D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP46" edc:desc="Write Protect Program Flash Page 46" edc:when="(field &amp; 0xff) == 0x2E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP47" edc:desc="Write Protect Program Flash Page 47" edc:when="(field &amp; 0xff) == 0x2F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP48" edc:desc="Write Protect Program Flash Page 48" edc:when="(field &amp; 0xff) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="WPFP49" edc:desc="Write Protect Program Flash Page 49" edc:when="(field &amp; 0xff) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="WPFP50" edc:desc="Write Protect Program Flash Page 50" edc:when="(field &amp; 0xff) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="WPFP51" edc:desc="Write Protect Program Flash Page 51" edc:when="(field &amp; 0xff) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="WPFP52" edc:desc="Write Protect Program Flash Page 52" edc:when="(field &amp; 0xff) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="WPFP53" edc:desc="Write Protect Program Flash Page 53" edc:when="(field &amp; 0xff) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="WPFP54" edc:desc="Write Protect Program Flash Page 54" edc:when="(field &amp; 0xff) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="WPFP55" edc:desc="Write Protect Program Flash Page 55" edc:when="(field &amp; 0xff) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="WPFP56" edc:desc="Write Protect Program Flash Page 56" edc:when="(field &amp; 0xff) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="WPFP57" edc:desc="Write Protect Program Flash Page 57" edc:when="(field &amp; 0xff) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="WPFP58" edc:desc="Write Protect Program Flash Page 58" edc:when="(field &amp; 0xff) == 0x3A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP59" edc:desc="Write Protect Program Flash Page 59" edc:when="(field &amp; 0xff) == 0x3B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP60" edc:desc="Write Protect Program Flash Page 60" edc:when="(field &amp; 0xff) == 0x3C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP61" edc:desc="Write Protect Program Flash Page 61" edc:when="(field &amp; 0xff) == 0x3D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP62" edc:desc="Write Protect Program Flash Page 62" edc:when="(field &amp; 0xff) == 0x3E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP63" edc:desc="Write Protect Program Flash Page 63" edc:when="(field &amp; 0xff) == 0x3F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP64" edc:desc="Write Protect Program Flash Page 64" edc:when="(field &amp; 0xff) == 0x40"/>
              <edc:DCRFieldSemantic edc:cname="WPFP65" edc:desc="Write Protect Program Flash Page 65" edc:when="(field &amp; 0xff) == 0x41"/>
              <edc:DCRFieldSemantic edc:cname="WPFP66" edc:desc="Write Protect Program Flash Page 66" edc:when="(field &amp; 0xff) == 0x42"/>
              <edc:DCRFieldSemantic edc:cname="WPFP67" edc:desc="Write Protect Program Flash Page 67" edc:when="(field &amp; 0xff) == 0x43"/>
              <edc:DCRFieldSemantic edc:cname="WPFP68" edc:desc="Write Protect Program Flash Page 68" edc:when="(field &amp; 0xff) == 0x44"/>
              <edc:DCRFieldSemantic edc:cname="WPFP69" edc:desc="Write Protect Program Flash Page 69" edc:when="(field &amp; 0xff) == 0x45"/>
              <edc:DCRFieldSemantic edc:cname="WPFP70" edc:desc="Write Protect Program Flash Page 70" edc:when="(field &amp; 0xff) == 0x46"/>
              <edc:DCRFieldSemantic edc:cname="WPFP71" edc:desc="Write Protect Program Flash Page 71" edc:when="(field &amp; 0xff) == 0x47"/>
              <edc:DCRFieldSemantic edc:cname="WPFP72" edc:desc="Write Protect Program Flash Page 72" edc:when="(field &amp; 0xff) == 0x48"/>
              <edc:DCRFieldSemantic edc:cname="WPFP73" edc:desc="Write Protect Program Flash Page 73" edc:when="(field &amp; 0xff) == 0x49"/>
              <edc:DCRFieldSemantic edc:cname="WPFP74" edc:desc="Write Protect Program Flash Page 74" edc:when="(field &amp; 0xff) == 0x4A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP75" edc:desc="Write Protect Program Flash Page 75" edc:when="(field &amp; 0xff) == 0x4B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP76" edc:desc="Write Protect Program Flash Page 76" edc:when="(field &amp; 0xff) == 0x4C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP77" edc:desc="Write Protect Program Flash Page 77" edc:when="(field &amp; 0xff) == 0x4D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP78" edc:desc="Write Protect Program Flash Page 78" edc:when="(field &amp; 0xff) == 0x4E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP79" edc:desc="Write Protect Program Flash Page 79" edc:when="(field &amp; 0xff) == 0x4F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP80" edc:desc="Write Protect Program Flash Page 80" edc:when="(field &amp; 0xff) == 0x50"/>
              <edc:DCRFieldSemantic edc:cname="WPFP81" edc:desc="Write Protect Program Flash Page 81" edc:when="(field &amp; 0xff) == 0x51"/>
              <edc:DCRFieldSemantic edc:cname="WPFP82" edc:desc="Write Protect Program Flash Page 82" edc:when="(field &amp; 0xff) == 0x52"/>
              <edc:DCRFieldSemantic edc:cname="WPFP83" edc:desc="Write Protect Program Flash Page 83" edc:when="(field &amp; 0xff) == 0x53"/>
              <edc:DCRFieldSemantic edc:cname="WPFP84" edc:desc="Write Protect Program Flash Page 84" edc:when="(field &amp; 0xff) == 0x54"/>
              <edc:DCRFieldSemantic edc:cname="WPFP85" edc:desc="Write Protect Program Flash Page 85" edc:when="(field &amp; 0xff) == 0x55"/>
              <edc:DCRFieldSemantic edc:cname="WPFP86" edc:desc="Write Protect Program Flash Page 86" edc:when="(field &amp; 0xff) == 0x56"/>
              <edc:DCRFieldSemantic edc:cname="WPFP87" edc:desc="Write Protect Program Flash Page 87" edc:when="(field &amp; 0xff) == 0x57"/>
              <edc:DCRFieldSemantic edc:cname="WPFP88" edc:desc="Write Protect Program Flash Page 88" edc:when="(field &amp; 0xff) == 0x58"/>
              <edc:DCRFieldSemantic edc:cname="WPFP89" edc:desc="Write Protect Program Flash Page 89" edc:when="(field &amp; 0xff) == 0x59"/>
              <edc:DCRFieldSemantic edc:cname="WPFP90" edc:desc="Write Protect Program Flash Page 90" edc:when="(field &amp; 0xff) == 0x5A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP91" edc:desc="Write Protect Program Flash Page 91" edc:when="(field &amp; 0xff) == 0x5B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP92" edc:desc="Write Protect Program Flash Page 92" edc:when="(field &amp; 0xff) == 0x5C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP93" edc:desc="Write Protect Program Flash Page 93" edc:when="(field &amp; 0xff) == 0x5D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP94" edc:desc="Write Protect Program Flash Page 94" edc:when="(field &amp; 0xff) == 0x5E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP95" edc:desc="Write Protect Program Flash Page 95" edc:when="(field &amp; 0xff) == 0x5F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP96" edc:desc="Write Protect Program Flash Page 96" edc:when="(field &amp; 0xff) == 0x60"/>
              <edc:DCRFieldSemantic edc:cname="WPFP97" edc:desc="Write Protect Program Flash Page 97" edc:when="(field &amp; 0xff) == 0x61"/>
              <edc:DCRFieldSemantic edc:cname="WPFP98" edc:desc="Write Protect Program Flash Page 98" edc:when="(field &amp; 0xff) == 0x62"/>
              <edc:DCRFieldSemantic edc:cname="WPFP99" edc:desc="Write Protect Program Flash Page 99" edc:when="(field &amp; 0xff) == 0x63"/>
              <edc:DCRFieldSemantic edc:cname="WPFP100" edc:desc="Write Protect Program Flash Page 100" edc:when="(field &amp; 0xff) == 0x64"/>
              <edc:DCRFieldSemantic edc:cname="WPFP101" edc:desc="Write Protect Program Flash Page 101" edc:when="(field &amp; 0xff) == 0x65"/>
              <edc:DCRFieldSemantic edc:cname="WPFP102" edc:desc="Write Protect Program Flash Page 102" edc:when="(field &amp; 0xff) == 0x66"/>
              <edc:DCRFieldSemantic edc:cname="WPFP103" edc:desc="Write Protect Program Flash Page 103" edc:when="(field &amp; 0xff) == 0x67"/>
              <edc:DCRFieldSemantic edc:cname="WPFP104" edc:desc="Write Protect Program Flash Page 104" edc:when="(field &amp; 0xff) == 0x68"/>
              <edc:DCRFieldSemantic edc:cname="WPFP105" edc:desc="Write Protect Program Flash Page 105" edc:when="(field &amp; 0xff) == 0x69"/>
              <edc:DCRFieldSemantic edc:cname="WPFP106" edc:desc="Write Protect Program Flash Page 106" edc:when="(field &amp; 0xff) == 0x6A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP107" edc:desc="Write Protect Program Flash Page 107" edc:when="(field &amp; 0xff) == 0x6B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP108" edc:desc="Write Protect Program Flash Page 108" edc:when="(field &amp; 0xff) == 0x6C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP109" edc:desc="Write Protect Program Flash Page 109" edc:when="(field &amp; 0xff) == 0x6D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP110" edc:desc="Write Protect Program Flash Page 110" edc:when="(field &amp; 0xff) == 0x6E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP111" edc:desc="Write Protect Program Flash Page 111" edc:when="(field &amp; 0xff) == 0x6F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP112" edc:desc="Write Protect Program Flash Page 112" edc:when="(field &amp; 0xff) == 0x70"/>
              <edc:DCRFieldSemantic edc:cname="WPFP113" edc:desc="Write Protect Program Flash Page 113" edc:when="(field &amp; 0xff) == 0x71"/>
              <edc:DCRFieldSemantic edc:cname="WPFP114" edc:desc="Write Protect Program Flash Page 114" edc:when="(field &amp; 0xff) == 0x72"/>
              <edc:DCRFieldSemantic edc:cname="WPFP115" edc:desc="Write Protect Program Flash Page 115" edc:when="(field &amp; 0xff) == 0x73"/>
              <edc:DCRFieldSemantic edc:cname="WPFP116" edc:desc="Write Protect Program Flash Page 116" edc:when="(field &amp; 0xff) == 0x74"/>
              <edc:DCRFieldSemantic edc:cname="WPFP117" edc:desc="Write Protect Program Flash Page 117" edc:when="(field &amp; 0xff) == 0x75"/>
              <edc:DCRFieldSemantic edc:cname="WPFP118" edc:desc="Write Protect Program Flash Page 118" edc:when="(field &amp; 0xff) == 0x76"/>
              <edc:DCRFieldSemantic edc:cname="WPFP119" edc:desc="Write Protect Program Flash Page 119" edc:when="(field &amp; 0xff) == 0x77"/>
              <edc:DCRFieldSemantic edc:cname="WPFP120" edc:desc="Write Protect Program Flash Page 120" edc:when="(field &amp; 0xff) == 0x78"/>
              <edc:DCRFieldSemantic edc:cname="WPFP121" edc:desc="Write Protect Program Flash Page 121" edc:when="(field &amp; 0xff) == 0x79"/>
              <edc:DCRFieldSemantic edc:cname="WPFP122" edc:desc="Write Protect Program Flash Page 122" edc:when="(field &amp; 0xff) == 0x7A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP123" edc:desc="Write Protect Program Flash Page 123" edc:when="(field &amp; 0xff) == 0x7B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP124" edc:desc="Write Protect Program Flash Page 124" edc:when="(field &amp; 0xff) == 0x7C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP125" edc:desc="Write Protect Program Flash Page 125" edc:when="(field &amp; 0xff) == 0x7D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP126" edc:desc="Write Protect Program Flash Page 126" edc:when="(field &amp; 0xff) == 0x7E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP127" edc:desc="Write Protect Program Flash Page 127" edc:when="(field &amp; 0xff) == 0x7F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP128" edc:desc="Write Protect Program Flash Page 128" edc:when="(field &amp; 0xff) == 0x80"/>
              <edc:DCRFieldSemantic edc:cname="WPFP129" edc:desc="Write Protect Program Flash Page 129" edc:when="(field &amp; 0xff) == 0x81"/>
              <edc:DCRFieldSemantic edc:cname="WPFP130" edc:desc="Write Protect Program Flash Page 130" edc:when="(field &amp; 0xff) == 0x82"/>
              <edc:DCRFieldSemantic edc:cname="WPFP131" edc:desc="Write Protect Program Flash Page 131" edc:when="(field &amp; 0xff) == 0x83"/>
              <edc:DCRFieldSemantic edc:cname="WPFP132" edc:desc="Write Protect Program Flash Page 132" edc:when="(field &amp; 0xff) == 0x84"/>
              <edc:DCRFieldSemantic edc:cname="WPFP133" edc:desc="Write Protect Program Flash Page 133" edc:when="(field &amp; 0xff) == 0x85"/>
              <edc:DCRFieldSemantic edc:cname="WPFP134" edc:desc="Write Protect Program Flash Page 134" edc:when="(field &amp; 0xff) == 0x86"/>
              <edc:DCRFieldSemantic edc:cname="WPFP135" edc:desc="Write Protect Program Flash Page 135" edc:when="(field &amp; 0xff) == 0x87"/>
              <edc:DCRFieldSemantic edc:cname="WPFP136" edc:desc="Write Protect Program Flash Page 136" edc:when="(field &amp; 0xff) == 0x88"/>
              <edc:DCRFieldSemantic edc:cname="WPFP137" edc:desc="Write Protect Program Flash Page 137" edc:when="(field &amp; 0xff) == 0x89"/>
              <edc:DCRFieldSemantic edc:cname="WPFP138" edc:desc="Write Protect Program Flash Page 138" edc:when="(field &amp; 0xff) == 0x8A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP139" edc:desc="Write Protect Program Flash Page 139" edc:when="(field &amp; 0xff) == 0x8B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP140" edc:desc="Write Protect Program Flash Page 140" edc:when="(field &amp; 0xff) == 0x8C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP141" edc:desc="Write Protect Program Flash Page 141" edc:when="(field &amp; 0xff) == 0x8D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP142" edc:desc="Write Protect Program Flash Page 142" edc:when="(field &amp; 0xff) == 0x8E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP143" edc:desc="Write Protect Program Flash Page 143" edc:when="(field &amp; 0xff) == 0x8F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP144" edc:desc="Write Protect Program Flash Page 144" edc:when="(field &amp; 0xff) == 0x90"/>
              <edc:DCRFieldSemantic edc:cname="WPFP145" edc:desc="Write Protect Program Flash Page 145" edc:when="(field &amp; 0xff) == 0x91"/>
              <edc:DCRFieldSemantic edc:cname="WPFP146" edc:desc="Write Protect Program Flash Page 146" edc:when="(field &amp; 0xff) == 0x92"/>
              <edc:DCRFieldSemantic edc:cname="WPFP147" edc:desc="Write Protect Program Flash Page 147" edc:when="(field &amp; 0xff) == 0x93"/>
              <edc:DCRFieldSemantic edc:cname="WPFP148" edc:desc="Write Protect Program Flash Page 148" edc:when="(field &amp; 0xff) == 0x94"/>
              <edc:DCRFieldSemantic edc:cname="WPFP149" edc:desc="Write Protect Program Flash Page 149" edc:when="(field &amp; 0xff) == 0x95"/>
              <edc:DCRFieldSemantic edc:cname="WPFP150" edc:desc="Write Protect Program Flash Page 150" edc:when="(field &amp; 0xff) == 0x96"/>
              <edc:DCRFieldSemantic edc:cname="WPFP151" edc:desc="Write Protect Program Flash Page 151" edc:when="(field &amp; 0xff) == 0x97"/>
              <edc:DCRFieldSemantic edc:cname="WPFP152" edc:desc="Write Protect Program Flash Page 152" edc:when="(field &amp; 0xff) == 0x98"/>
              <edc:DCRFieldSemantic edc:cname="WPFP153" edc:desc="Write Protect Program Flash Page 153" edc:when="(field &amp; 0xff) == 0x99"/>
              <edc:DCRFieldSemantic edc:cname="WPFP154" edc:desc="Write Protect Program Flash Page 154" edc:when="(field &amp; 0xff) == 0x9A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP155" edc:desc="Write Protect Program Flash Page 155" edc:when="(field &amp; 0xff) == 0x9B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP156" edc:desc="Write Protect Program Flash Page 156" edc:when="(field &amp; 0xff) == 0x9C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP157" edc:desc="Write Protect Program Flash Page 157" edc:when="(field &amp; 0xff) == 0x9D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP158" edc:desc="Write Protect Program Flash Page 158" edc:when="(field &amp; 0xff) == 0x9E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP159" edc:desc="Write Protect Program Flash Page 159" edc:when="(field &amp; 0xff) == 0x9F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP160" edc:desc="Write Protect Program Flash Page 160" edc:when="(field &amp; 0xff) == 0xA0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP161" edc:desc="Write Protect Program Flash Page 161" edc:when="(field &amp; 0xff) == 0xA1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP162" edc:desc="Write Protect Program Flash Page 162" edc:when="(field &amp; 0xff) == 0xA2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP163" edc:desc="Write Protect Program Flash Page 163" edc:when="(field &amp; 0xff) == 0xA3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP164" edc:desc="Write Protect Program Flash Page 164" edc:when="(field &amp; 0xff) == 0xA4"/>
