balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66J94.PIC
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG6H" edc:default="0xFF" edc:desc="" edc:impl="0xff" edc:name="CONFIG6H" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xFF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x3" edc:name="WDTEN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="SWDTDIS" edc:desc="WDT enabled in hardware; SWDTEN bit disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT controlled by SWDTEN bit setting" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="NOSLP" edc:desc="WDT enabled only while device is active and disabled in Sleep mode; SWDTEN bit disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled in hardware; SWDTEN bit disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Windowed Watchdog Timer Disable" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="WDTSTD" edc:desc="Standard WDT selected; windowed WDT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTWIN" edc:desc="Windowed WDT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPSA" edc:desc="WDT Prescaler" edc:mask="0x1" edc:name="WPSA" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="128" edc:desc="WDT prescaler ratio of 1:128" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="32" edc:desc="WDT prescaler ratio of 1:32" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="---nnn-n" edc:cname="CONFIG7L" edc:default="0x1D" edc:desc="" edc:impl="0x1d" edc:name="CONFIG7L" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1D">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RETEN" edc:desc="Retention Voltage Regulator Control Enable" edc:mask="0x1" edc:name="RETEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Retention not available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Retention controlled by SRETEN during Sleep" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="VBTBOR" edc:desc="VBAT BOR Enable" edc:mask="0x1" edc:name="VBTBOR" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBAT BOR is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBAT BOR is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSBOREN" edc:desc="Deep Sleep BOR Enable" edc:mask="0x1" edc:name="DSBOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BOR enabled in Deep Sleep" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BOR disabled in Deep Sleep (does not affect operation in non-Deep Sleep modes)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSBITEN" edc:desc="DSEN Bit Enable bit" edc:mask="0x1" edc:name="DSBITEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Deep Sleep is controlled by the register bit DSEN" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Deep Sleep operation is always disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------" edc:cname="CONFIG7H" edc:default="0xF0" edc:desc="" edc:impl="0xf0" edc:name="CONFIG7H" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xF0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnn---" edc:cname="CONFIG8L" edc:default="0xF8" edc:desc="" edc:impl="0xf8" edc:name="CONFIG8L" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xF8">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:desc="Deep Sleep Watchdog Timer Postscale Select" edc:mask="0x1f" edc:name="DSWDTPS" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1F" edc:desc="1:68719476736 (25.7 Days)" edc:when="(field &amp; 0x1f) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1E" edc:desc="1:34359738368 (12.8  Days)" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1D" edc:desc="1:17179869184 (6.4 Days)" edc:when="(field &amp; 0x1f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1C" edc:desc="1:8589934592 (77 Hours)" edc:when="(field &amp; 0x1f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1B" edc:desc="1:4294967296 (38.5 Hours)" edc:when="(field &amp; 0x1f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1A" edc:desc="1:2147483648 (19.2 Hours)" edc:when="(field &amp; 0x1f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS19" edc:desc="1:1073741824 (9.6 Hours)" edc:when="(field &amp; 0x1f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS18" edc:desc="1:536870912 (4.8 Hours)" edc:when="(field &amp; 0x1f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS17" edc:desc="1:268435456 (2.4 Hours)" edc:when="(field &amp; 0x1f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS16" edc:desc="1:134217728 (72.2 Minutes)" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS15" edc:desc="1:67108864 (36.1 Minutes)" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS14" edc:desc="1:33554432 (18 Minutes)" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS13" edc:desc="1:16777216 (9 Minutes)" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS12" edc:desc="1:8388608 (4.5 Minutes)" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS11" edc:desc="1:4194304 (135.3 Secs)" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS10" edc:desc="1:2097152 (67.7 Secs)" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSF" edc:desc="1:1048576 (33.825 Secs)" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSE" edc:desc="1:524288 (16.912 Secs)" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSD" edc:desc="1:262114 (8.456 Secs)" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSC" edc:desc="1:131072 (4.228 Secs)" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSB" edc:desc="1:65536 (2.114 Secs)" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSA" edc:desc="1:32768 (1.057 Secs)" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS9" edc:desc="1:16384 (528.5 mS)" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS8" edc:desc="1:8192 (264.3 mS)" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS7" edc:desc="1:4096 (132.1 mS)" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS6" edc:desc="1:2048 (66.1 mS)" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS5" edc:desc="1:1024 (33 mS)" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS4" edc:desc="1:512 (16.5 mS)" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS3" edc:desc="1: 256 (8.3 mS)" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS2" edc:desc="1:128 (4.1 mS)" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1" edc:desc="1:64 (2.1 mS)" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS0" edc:desc="1:32 (1 mS)" edc:when="(field &amp; 0x1f) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="------nn" edc:cname="CONFIG8H" edc:default="0xF3" edc:desc="" edc:impl="0xf3" edc:name="CONFIG8H" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xF3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer Enable" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="DSWDT Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="DSWDT Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:desc="DSWDT Reference Clock Select" edc:mask="0x1" edc:name="DSWDTOSC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="DSWDT uses LPRC as reference clock" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="DSWDT uses SOSC as reference clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:WORMHoleSector>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200400" edc:regionid="testmem"/>
    <edc:ConfigWORMSector edc:beginaddr="0x300000" edc:endaddr="0x300010" edc:regionid="cfgwormmem"/>
    <edc:DeviceIDSector edc:beginaddr="0x3ffffe" edc:endaddr="0x400000" edc:mask="0xffe0" edc:regionid="devid" edc:value="0x63E0"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x200028" edc:endaddr="0x200038" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:PinList>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PSPWR"/>
      <edc:VirtualPin edc:name="RP29" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="LCDBIAS2"/>
      <edc:VirtualPin edc:name="HSTCLK2"/>
      <edc:VirtualPin edc:name="LCDCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PSPRD"/>
      <edc:VirtualPin edc:name="RP28" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="LCDBIAS1"/>
      <edc:VirtualPin edc:name="HSTCLK1"/>
      <edc:VirtualPin edc:name="LCDPHASE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="RP46" edc:ppsgroup="3" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="SEG28"/>
      <edc:VirtualPin edc:name="COM4"/>
      <edc:VirtualPin edc:name="DSEG28"/>
      <edc:VirtualPin edc:name="DCOM4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="RP39" edc:ppsgroup="4" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="SEG29"/>
      <edc:VirtualPin edc:name="COM5"/>
      <edc:VirtualPin edc:name="DSEG29"/>
      <edc:VirtualPin edc:name="DCOM5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="RP42" edc:ppsgroup="3" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="AN18"/>
      <edc:VirtualPin edc:name="SEG30"/>
      <edc:VirtualPin edc:name="COM6"/>
      <edc:VirtualPin edc:name="DSEG30"/>
      <edc:VirtualPin edc:name="DCOM6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="RP43" edc:ppsgroup="4" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="AN17"/>
      <edc:VirtualPin edc:name="SEG31"/>
      <edc:VirtualPin edc:name="COM7"/>
      <edc:VirtualPin edc:name="DSEG31"/>
      <edc:VirtualPin edc:name="DCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG5"/>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG4"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RP44" edc:ppsgroup="1" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="AN16"/>
      <edc:VirtualPin edc:name="SEG26"/>
      <edc:VirtualPin edc:name="DSEG26"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vddcore"/>
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="RP38" edc:ppsgroup="3" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="SEG25"/>
      <edc:VirtualPin edc:name="TGMIO1"/>
      <edc:VirtualPin edc:name="DSEG25"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="RP40" edc:ppsgroup="1" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="SEG24"/>
      <edc:VirtualPin edc:name="TGMIO0"/>
      <edc:VirtualPin edc:name="DSEG24"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="RP35" edc:ppsgroup="4" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVREF"/>
      <edc:VirtualPin edc:name="SEG23"/>
      <edc:VirtualPin edc:name="DSEG23"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="RP45" edc:ppsgroup="2" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="RP41" edc:ppsgroup="2" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="RP36" edc:ppsgroup="1" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="CTCMP"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="SEG20"/>
      <edc:VirtualPin edc:name="DSEG20"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vusb"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vbat"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVREF+"/>
      <edc:VirtualPin edc:name="Avdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVREF-"/>
      <edc:VirtualPin edc:name="VSEL2"/>
      <edc:VirtualPin edc:name="Avss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="RP3" edc:ppsgroup="4" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="CVREF+"/>
      <edc:VirtualPin edc:name="TSTRA7"/>
      <edc:VirtualPin edc:name="TSTHFRC"/>
      <edc:VirtualPin edc:name="SCANEUPDT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="RP2" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="CVref-"/>
      <edc:VirtualPin edc:name="SEG21"/>
      <edc:VirtualPin edc:name="TSTAOUT"/>
      <edc:VirtualPin edc:name="TSTRA6"/>
      <edc:VirtualPin edc:name="TGMSDO"/>
      <edc:VirtualPin edc:name="DSEG21"/>
      <edc:VirtualPin edc:name="SCANEN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="RP1" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="SEG18"/>
      <edc:VirtualPin edc:name="TSTRA5"/>
      <edc:VirtualPin edc:name="TGMSS"/>
      <edc:VirtualPin edc:name="DSEG18"/>
      <edc:VirtualPin edc:name="TSTLPRC"/>
      <edc:VirtualPin edc:name="SCANRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="RP0" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN1-"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="SEG19"/>
      <edc:VirtualPin edc:name="TSTAIN_LV"/>
      <edc:VirtualPin edc:name="TSTAIN_MV"/>
      <edc:VirtualPin edc:name="TSTRA4"/>
      <edc:VirtualPin edc:name="TGMREFO"/>
      <edc:VirtualPin edc:name="DSEG19"/>
      <edc:VirtualPin edc:name="SCANCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSEL1"/>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="RP5" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="SEG15"/>
      <edc:VirtualPin edc:name="TSTDOUT"/>
      <edc:VirtualPin edc:name="DSEG15"/>
      <edc:VirtualPin edc:name="SCANSDI1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="RP4" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="SEG14"/>
      <edc:VirtualPin edc:name="TSTDIN"/>
      <edc:VirtualPin edc:name="DSEG14"/>
      <edc:VirtualPin edc:name="SCANSDI0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="INSTR[9,1]c"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="PWRLCLK"/>
      <edc:VirtualPin edc:name="SCLKI"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="INSTR[8,0]c"/>
      <edc:VirtualPin edc:name="TSTSOSC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="CTED11"/>
      <edc:VirtualPin edc:name="USBOEN"/>
      <edc:VirtualPin edc:name="RP18" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="SEG27"/>
      <edc:VirtualPin edc:name="INSTR[14,6]c"/>
      <edc:VirtualPin edc:name="TSTUOE"/>
      <edc:VirtualPin edc:name="DSEG27"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="RP19" edc:ppsgroup="4" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SEG22"/>
      <edc:VirtualPin edc:name="INSTR[15,7]c"/>
      <edc:VirtualPin edc:name="TSTVPI"/>
      <edc:VirtualPin edc:name="DSEG22"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="CTED7"/>
      <edc:VirtualPin edc:name="RP11" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="SEG13"/>
      <edc:VirtualPin edc:name="INSTR[10,2]c"/>
      <edc:VirtualPin edc:name="TGMSCL_SCK"/>
      <edc:VirtualPin edc:name="TSTVPO"/>
      <edc:VirtualPin edc:name="DSEG13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="CTED8"/>
      <edc:VirtualPin edc:name="RP15" edc:ppsgroup="4" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="SEG17"/>
      <edc:VirtualPin edc:name="INSTR[11,3]c"/>
      <edc:VirtualPin edc:name="TGMOSCL_SCK"/>
      <edc:VirtualPin edc:name="TSTVMO"/>
      <edc:VirtualPin edc:name="DSEG17"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="CTED9"/>
      <edc:VirtualPin edc:name="RP17" edc:ppsgroup="2" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="SEG16"/>
      <edc:VirtualPin edc:name="INSTR[12,4]c"/>
      <edc:VirtualPin edc:name="TGMOSDA_SDI"/>
      <edc:VirtualPin edc:name="TSTRCV"/>
      <edc:VirtualPin edc:name="DSEG16"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="RP16" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SEG12"/>
      <edc:VirtualPin edc:name="INSTR[13,5]c"/>
      <edc:VirtualPin edc:name="TGMSDA_SDI"/>
      <edc:VirtualPin edc:name="TSTVMI"/>
      <edc:VirtualPin edc:name="DSEG12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="INSTR[15,7]"/>
      <edc:VirtualPin edc:name="EMUD"/>
      <edc:VirtualPin edc:name="ADDR8"/>
      <edc:VirtualPin edc:name="PGD"/>
      <edc:VirtualPin edc:name="SCANCFGDATA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="RP10" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSCI"/>
      <edc:VirtualPin edc:name="SCANSDI3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="RP6" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSCO"/>
      <edc:VirtualPin edc:name="SCANSDI2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSEL3b"/>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="INSTR[14,6]"/>
      <edc:VirtualPin edc:name="EMUC"/>
      <edc:VirtualPin edc:name="ADDR7"/>
      <edc:VirtualPin edc:name="PGC"/>
      <edc:VirtualPin edc:name="SCANCFGCLK"/>
    </edc:Pin>
